def analyze_string(s): #Функція призначена для аналізу текстового рядка
    vowels = 'aeiouAEIOU' #Оголошення списку голосних літер для англійської мови
    vowel_chars = ''  # Ініціалізація змінної для збереження знайдених голосних літер
    consonant_chars = '' # Ініціалізація змінної для збереження знайдених приголосних літер
    
    for char in s: #цикл перевіряє елементи в стрінгу
            if char in vowels: #задаємо умову: якщо елемент належить до голосних то
                vowel_chars += char #то додаємо елемент до змінної для голосних
            else: #якщо інакше то
                consonant_chars += char #то додаємо елемент до змінної для голосних
    
    return (vowel_chars, len(vowel_chars), consonant_chars) #Повертаємо кортеж із результатами: 1) рядок голосних, 2) кількість голосних, 3) рядок приголосних.
result = analyze_string("oakd")
print(result)